app/controllers/computers_controller.rb

SELECT * FROM "computers" WHERE ("computers"."id" = 1)
---
  def show
    stats
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 2)
---
  def edit
    stats
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE ("computers"."id" = 5504)
---
  def update
    @computer = Computer.find(params[:id])

SELECT * FROM "computers" WHERE (name LIKE '%computer_five%') ORDER BY name ASC LIMIT 10
---
  def search
    stats
    if not params[:computer][:name].nil?
      @computers = Computer.find(:all,
                                 :conditions => [ 'LOWER(name) LIKE ?',
                                                  '%' + params[:computer][:name].downcase + '%' ],
                                 :order => 'name ASC',
                                 :limit => 8)

SELECT count(*) AS count_all FROM "computers" WHERE (available = 't')
---
  def stats
    google_chart([Computer.available.count, Computer.unavailable.count],
                 ['Availables', 'Unavailables'],
                 Computer.find(:all).count, 'chart'
                 )