app/controllers/dvds_controller.rb

  def index
    flash[:notice] = t('phrases.list_of') + t('menu.dvds').downcase
    @dvds = Dvd.paginate(
                          :page => params[:page],
                          :per_page => PER_PAGE,
                          :order => 'created_at DESC')
---
SELECT * FROM "dvds" ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @dvd = Dvd.find(params[:id])
---
SELECT * FROM "dvds" WHERE ("dvds"."id" = 0)