app/controllers/harddisks_controller.rb

  def index
    @harddisks = Harddisk.paginate(
                                   :page => params[:page],
                                   :per_page => 5,
                                   :order => 'created_at DESC')
---
SELECT * FROM "harddisks" ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @harddisk = Harddisk.find(params[:id])
---
SELECT * FROM "harddisks" WHERE ("harddisks"."id" = 0)

  def edit
    @harddisk = Harddisk.find(params[:id])
---
SELECT * FROM "harddisks" WHERE ("harddisks"."id" = 2)

  def search
    if not params[:harddisk][:model].nil?
        @harddisks = Harddisk.find(:all,
                                   :conditions => [ 'LOWER(model) LIKE ?',
                                                    '%' + params[:harddisk][:model].downcase + '%' ],
                                   :order => 'model ASC',
                                   :limit => 8)
---
SELECT * FROM "harddisks" WHERE (serialnumber LIKE '%121234000%') ORDER BY serialnumber ASC LIMIT 10