app/controllers/marks_controller.rb

SELECT * FROM "marks"
---
  def index
    @marks = Mark.paginate(
                       :page => params[:page],
                       :per_page => PER_PAGE,
                       :select => 'id, name',
                       :order => 'name ASC')