app/controllers/memories_controller.rb

SELECT * FROM "memories" ORDER BY created_at DESC LIMIT 10 OFFSET 0
---
  def index
    flash[:notice] = t('phrases.list_of') + t('menu.memories').downcase
    @memories = Memory.paginate(
                                :page => params[:page],
                                :per_page => PER_PAGE,
                                :order => 'created_at DESC')