app/controllers/mother_boards_controller.rb

SELECT * FROM "mother_boards" WHERE ("mother_boards"."id" = 0)
---
  def show
    @mother_board = MotherBoard.find(params[:id])

SELECT * FROM "mother_boards" WHERE ("mother_boards"."id" = 2)
---
  def edit
    @mother_board = MotherBoard.find(params[:id])

SELECT * FROM "mother_boards" WHERE (serialnumber LIKE '%121234000%') ORDER BY serialnumber ASC LIMIT 10
---
  def search
    if not params[:mother_board][:title].nil?
        @mother_boards = MotherBoard.find(:all,
                                   :conditions => [ 'LOWER(title) LIKE ?',
                                                    '%' + params[:mother_board][:title].downcase + '%' ],
                                   :order => 'title ASC',
                                   :limit => 8)