app/controllers/mother_boards_controller.rb

  def index
    flash[:notice] = t('phrases.list_of') + t('menu.motherboards').downcase
    @mother_boards = MotherBoard.paginate(
                                   :page => params[:page],
                                   :per_page => PER_PAGE,
                                   :order => 'created_at DESC')
---
SELECT * FROM "mother_boards" ORDER BY created_at DESC LIMIT 10 OFFSET 0