app/controllers/places_controller.rb

  def stats
    google_chart([Place.departments.count,
                  Place.offices.count,
                  Place.stores.count,
                  Place.rooms.count],
                 [t('places.departments'),
                  t('places.offices'),
                  t('places.stores'),
                  t('places.rooms')
                 ],
                 Place.find(:all).count,
                 'chart', t('places.graphic_stats_paragraph'))
---
SELECT count(*) AS count_all FROM "places" WHERE (description = 'department')