app/controllers/places_controller.rb

  def index
    flash[:notice] = t('phrases.list_of') + t('menu.places').downcase
    @places = Place.paginate(
                             :page => params[:page],
                             :per_page => PER_PAGE,
                             :order => 'created_at DESC',
                             :include => INCLUDE_PLACE
                             )
---
SELECT * FROM "places" ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @place = Place.find(params[:id], :select => 'id, title')
    @computers = Computer.list_for_place(@place.id).paginate(
                               :page => params[:page],
                               :per_page => PER_PAGE,
                               :include => INCLUDE_IN_COMPUTER,
                               :order => 'created_at DESC')
    @screens = Screen.list_for_place(@place.id).paginate(
                               :page => params[:page],
                               :per_page => PER_PAGE,
                               :include => INCLUDE_MARK,
                               :order => 'created_at DESC')
    @printers = Printer.list_for_place(@place.id).paginate(
                               :page => params[:page],
                               :per_page => PER_PAGE,
                               :include => INCLUDE_MARK,
                               :order => 'created_at DESC')
---
SELECT * FROM "places" WHERE ("places"."id" = 1)
SELECT * FROM "computers" WHERE (place_id = 1)
SELECT count(*) AS count_all FROM "computers" WHERE (place_id = 1)
SELECT * FROM "screens" WHERE (place_id = 1)
SELECT count(*) AS count_all FROM "screens" WHERE (place_id = 1)
SELECT * FROM "printers" WHERE (place_id = 1)
SELECT count(*) AS count_all FROM "printers" WHERE (place_id = 1)

  def edit
    @place = Place.find(params[:id])
---
SELECT * FROM "places" WHERE ("places"."id" = 1)

  def xls_computers
    xls_report('/public/xls/' +
               t('places.computer') +
               '_' +
               Place.find(params[:id]).title  +
               '.xls',
               'computers',
               'Computer',
               'computers',
               "[t('computers.name'),'mac','ip',t('computers.workstation?'),
                 'montherboard', 'harddisk', 'memory', 'cds', 'dvds']",
               "list_for_place",
               '(' + params[:id] + ')'
               )
---
SELECT * FROM "computers" WHERE (place_id = 1)
SELECT * FROM "dvds" WHERE ("dvds".computer_id = 1)
SELECT * FROM "harddisks" WHERE ("harddisks".computer_id = 1)
SELECT * FROM "memories" WHERE ("memories".computer_id = 1)

  def all_hardware

       xls_report_complete_for_a_place('/public/xls/' +
               'hardware ' +
               Place.find(params[:id]).title  +
               '.xls',
               "list_for_place",
               '(' + params[:id] + ')',
               "[t('computers.name'),'mac','ip',t('computers.workstation?'),
               'montherboard', 'harddisk', 'memory', 'cds', 'dvds']"
               )
---
SELECT * FROM "computers" WHERE (place_id = 1)
SELECT * FROM "dvds" WHERE ("dvds".computer_id = 1)
SELECT * FROM "harddisks" WHERE ("harddisks".computer_id = 1)
SELECT * FROM "memories" WHERE ("memories".computer_id = 1)

  def xls_printers
    xls_report('/public/xls/' +
               t('places.printer') +
               '_' +
               Place.find(params[:id]).title  +
               '.xls',
               'printers',
               'Printer',
               'printers',
               "['model', 'serial number']",
               "list_for_place",
               '(' + params[:id] + ')'
               )
---
SELECT * FROM "places" WHERE ("places"."id" = 1)
SELECT * FROM "printers" WHERE (place_id = 1)

  def xls_screens
    xls_report('/public/xls/' +
               t('places.screen') +
               '_' +
               Place.find(params[:id]).title  +
               '.xls',
               'screens',
               'Screen',
               'screens',
               "['model', 'serial number']",
               "list_for_place",
               '(' + params[:id] + ')'
               )
---
SELECT * FROM "places" WHERE ("places"."id" = 1)
SELECT * FROM "screens" WHERE (place_id = 1)

  def list
    case params[:places]
    when 'all'
      @places = Place.paginate(:page => params[:page],
                               :per_page => PER_PAGE,
                               :order => 'created_at DESC')
---
SELECT * FROM "places" ORDER BY created_at DESC LIMIT 10 OFFSET 0