app/controllers/printers_controller.rb

  def index
    @printers = Printer.paginate(
                               :page => params[:page],
                               :per_page => PER_PAGE,
                               :order => 'created_at DESC')
---
SELECT * FROM "printers"

  def show
    @printer = Printer.find(params[:id])
---
SELECT * FROM "printers" WHERE ("printers"."id" = 0)

  def edit
    @printer = Printer.find(params[:id])
---
SELECT * FROM "printers" WHERE ("printers"."id" = 3)