app/controllers/screens_controller.rb

SELECT * FROM "screens"
---
  def index
    @screens = Screen.paginate(
                               :page => params[:page],
                               :per_page => PER_PAGE,
                               :order => 'created_at DESC')

SELECT * FROM "screens" WHERE ("screens"."id" = 2)
---
  def show
    @screen = Screen.find(params[:id])

SELECT * FROM "screens" WHERE ("screens"."id" = 2)
---
  def edit
    @screen = Screen.find(params[:id])

SELECT * FROM "screens" WHERE ("screens"."id" = 2)
UPDATE "screens" SET "updated_at" = '2009-02-17 12:32:47', "place_id" = 3 WHERE "id" = 2
---
  def update
    @screen = Screen.find(params[:id])

    respond_to do |format|
      if @screen.update_attributes(params[:screen])