app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "language", "remember_token", "login", "email") VALUES('', '39d759b34a71b0789f3dc4293b4ff9eb311f160d', '2009-01-29 14:16:32', 'b8862a5de83342f278e27ac979a97f1a9bcaa4d1', NULL, '2009-01-29 14:16:32', 'en', NULL, 'quire', 'quire@example.com')