app/controllers/workstations_controller.rb

  def show
    @workstation = Workstation.find(params[:id])
---
SELECT * FROM "workstations" WHERE ("workstations"."id" = 0)

  def edit
    hardware_in_place
    @workstation = Workstation.find(params[:id])
---
SELECT * FROM "workstations" WHERE ("workstations"."id" = 38)

  def create
    hardware_in_place
    @workstation = Workstation.new(params[:workstation])

    respond_to do |format|
      if @workstation.save
---
INSERT INTO "workstations" ("computer_id", "created_at", "place_id", "printer_id", "updated_at", "screen_id") VALUES(4, '2009-02-17 12:33:12', 3, NULL, '2009-02-17 12:33:12', 2)

  def update
    @workstation = Workstation.find(params[:id])

    respond_to do |format|
      if @workstation.update_attributes(params[:workstation])
---
SELECT * FROM "workstations" WHERE ("workstations"."id" = 39)
UPDATE "workstations" SET "updated_at" = '2009-02-17 12:37:34', "place_id" = 4 WHERE "id" = 39